{"text": "Public sector banks generally accept applicants with a minimum age ranging from 18 to 21 years."}
{"text": "Private sector banks usually require a minimum borrower age of 21 years and co-applicant age of 18 years."}
{"text": "Rural and cooperative banks often accept applicants starting at 18 years, especially agricultural borrowers."}
{"text": "Small finance banks commonly accept applicants aged 25 years and above with household income proof."}
{"text": "Public sector banks may allow loan tenure up to 30 years or until the borrower reaches 70 years of age."}
{"text": "Private sector banks often limit repayment age to 65 for salaried and 70 for self-employed with stable income."}
{"text": "Small finance banks may allow loans till 75 years of age if repayment capacity is established."}
{"text": "Rural banks usually require the loan to be repaid by age 55 unless supported by income or family co-borrowers."}
{"text": "Public banks generally allow salaried, self-employed, and professionals with 2-3 years of experience."}
{"text": "Private sector banks typically require 2 years of continuous employment or 3 years in business."}
{"text": "Public sector banks may accept contractual employees with at least 3 years of uninterrupted service."}
{"text": "Private lenders may allow faster approval for salaried employees in government or reputed private companies."}
{"text": "Most banks, including public and private, accept co-applicants such as spouse, parents, or children."}
{"text": "Public and rural banks may mandate property mortgage for contractual or non-standard employment types."}
{"text": "Small finance banks support salaried and informal income earners, including professionals with cash income."}
{"text": "Private sector banks may allow up to 3 co-applicants for enhanced eligibility."}
{"text": "Public sector banks may relax maximum age limits for government and PSU employees up to 60 years."}
{"text": "Private banks generally limit salaried repayment age to 60 and self-employed to 65 to 70 years."}
{"text": "Public sector banks may allow higher age limits up to 75 for professionals with stable income sources."}
{"text": "Small finance banks require minimum household income, typically ₹10,000 per month or more."}
{"text": "Eligibility depends on repayment capacity, influenced by income, age, existing EMIs, and occupation stability."}
{"text": "Most lenders consider age between 21 and 65 years as eligible."}
{"text": "Home loan eligibility can depend on salary, business income, or other income sources."}
{"text": "A CIBIL score of 750 or more is generally considered good for home loan approval."}
{"text": "Some lenders may accept lower scores (650  - 749) with stricter terms or based on other eligibility criteria."}
{"text": "Minimum acceptable CIBIL score ranges from 650 to 700 depending on the financial institution."}
{"text": "Individuals above 18 years with a stable income source are generally eligible."}
{"text": "A co-borrower's income can be considered to enhance eligibility."}
{"text": "The EMI-to-NMI (Net Monthly Income) ratio can vary by income bracket from 20% to 66.67%."}
{"text": "Younger applicants are eligible for higher loan amounts and longer tenures."}
{"text": "Loan tenure typically reduces as applicant age increases."}
{"text": "Typical maximum loan tenures: 30 years (age  40), 25 years (age = 45)."}
{"text": "A CIBIL score of 725+ improves chances of loan approval."}
{"text": "Credit scores above 750 increase the likelihood of approval."}
{"text": "Eligibility also considers income, age, credit history, occupation continuity, and margin contribution."}
{"text": "Applicants should be Indian citizens aged 21+, with sufficient income and good credit history."}
{"text": "Employment requirements: salaried (2+ years), self-employed (2–3+ years)."}
{"text": "Net annual income thresholds: INR 5L (salaried), INR 7.5L (self-employed)."}
{"text": "Loan tenure may extend up to 25 to 30 years depending on employment type and lender policy."}
{"text": "Loan amounts range from INR 2,00,000 to INR 40 Cr (varies by lender)."}
{"text": "For NRI applicants, eligibility typically requires stable foreign income, valid ID proof, and an Indian co-obligant."}
{"text": "NRI borrowers are usually allowed if monthly income exceeds 50,000 and property is located in India."}
{"text": "Repayment period for NRIs is often capped at 55 to 60 years of age at loan maturity depending on employment type."}
{"text": "In small towns, rural banks may provide loans with group guarantees or for agricultural landholding applicants."}
{"text": "Private banks may use digital footprints like bill payments and past credit card usage to influence eligibility."}
